drop table if exists company_member;
create table company_member
(
    id         int auto_increment primary key comment '数据主键',
    `name`     varchar(50) not null comment '姓名',
    phone      varchar(30) not null comment '联系电话',
    email      varchar(60) not null comment '公司邮箱',
    belong_group    int         null comment '所属组别',
    position   varchar(20) not null default '1' comment '职位: 1: 员工; 0: 项目经理; 2:驻场经理; 3:经理助手; 4:技术总监; 5:小组组长; 默认: 1(员工)',
    on_the_job boolean     not null default true comment '在职状态: true: 在职; false: 不在职; 默认: true(在职)',
    address varchar(500) null comment  '居住地址'
) engine = InnoDB
  Default charset = utf8 comment '公司人员信息表';


insert into company_member (id, name, phone, email, belong_group, position, on_the_job, address)
values  (1, '周阗', '13550552702', '1', 2, '1', 1, '四川省成都市成华区万年场(街道/镇)鲁能城一期5-2505'),
        (2, '谢杰', '17765322520', '1', 1, '1', 1, '四川省成都市温江区百信路188号(街道/镇)明信仕林府15栋2804'),
        (3, '宋相吉', '18782402756', '1', 5, '1', 1, '四川省成都市双流区华府大道三段869号(街道/镇)万锦城3栋2801号'),
        (4, '米兵', '15608216607', '1', 2, '1', 1, '四川省成都市龙泉驿区西河镇(街道/镇)招商依云上城一期4栋一单元3402号'),
        (5, '廖乾助', '19138963169', '1', 1, '1', 1, '四川省成都市武侯区和顺路(街道/镇)清河小区'),
        (6, '汤亚萍', '18780338135', '1', 2, '1', 1, '四川省成都市双流区剑南大道南段(街道/镇)骑龙家园二期2栋3单元'),
        (7, '黄梁枭', '15281026785', 'huangliangxiao@yitong.com.cn', null, '4', 1, '四川省成都市高新区中和(街道/镇)仁和路480号1栋2201号'),
        (8, '王寅澄', '18980478817', 'wangyincheng@yitong.com.cn', null, '0,2', 1, '四川省成都市成华区二仙桥街道(街道/镇)民兴北二路蓝润V客尚东1期'),
        (9, '唐波', '13548430993', '1', 1, '5', 1, '四川省成都市武侯区玉林街道(街道/镇)玉洁东街2号院8栋1单元101'),
        (10, '赵瑶', '17340174181', '1', 3, '5', 1, '四川省成都市双流区华西下街202号(街道/镇)广都花园3-3-13'),
        (11, '施长瑞', '17621687058', '1', 2, '5', 1, '四川省成都市武侯区华兴街道(街道/镇)蓝光金悦城7-1-1703'),
        (12, '黄子昂', '18108120386', '1', 6, '1', 1, '四川省成都市天府新区梓州大道3139号(街道/镇)万科海悦汇城东区9-4206'),
        (13, '唐君发', '13880499159', '1', 3, '1', 1, '四川省成都市金牛区驷马桥街道(街道/镇)二环路北四段89号1819'),
        (14, '王忠海', '17311308650', '1', 3, '1', 1, '四川省成都市锦江区成龙路街道(街道/镇)海桐三期'),
        (15, '宋敏', '18202817250', '1', 4, '5', 1, '四川省成都市武侯区肖家河街道(街道/镇)兴蓉街10号 佳利花园三期3单元'),
        (16, '李磊', '14780401015', '1', 1, '1', 1, '四川省成都市高新区中和(街道/镇)中德英伦联邦b区503'),
        (17, '牟继攀', '13980361642', '1', 4, '1', 1, '四川省成都市高新区中和镇中和大道(街道/镇)领馆区1号'),
        (18, '万姝伶', '18280706061', '1', 6, '3,5', 1, '四川省成都市高新区老成仁路(街道/镇)育才竹岛'),
        (19, '李常林', '17602847443', '1', 5, '5', 1, '四川省成都市双流区协和街道(街道/镇)骑龙家园二期'),
        (20, '唐智林', '18226629710', '1', 4, '1', 1, '四川省成都市龙泉驿区龙泉街道(街道/镇)果壳里的城'),
        (21, '薛佳咪', '15208272725', '1', 1, '1', 1, '四川省成都市双流区东升街道(街道/镇)航港路33号'),
        (22, '罗静', '15680261580', 'luojing1@yitong.com.cn', 5, '1', 1, '四川省成都市天府新区华阳(街道/镇)华阳大道三段34号'),
        (23, '韩佳', '18384556907', 'hanjia@yitong.com.cn', 4, '1', 1, '四川省成都市双流区东寺北二路(街道/镇)怡馨家园10栋一单元201'),
        (24, '杨博坤', '15351629239', '1', 4, '1', 0, '四川省成都市双流区华阳街道(街道/镇)府河花园'),
        (25, '梁琪涔', '13668234387', 'liangqicen@yitong.com.cn', 5, '1', 1, '四川省成都市温江区柳城街道(街道/镇)德通桥路99号格澜威尔2栋3单元'),
        (26, '刘建国', '18200487980', 'liujianguo@yitong.com.cn', 4, '1', 1, '四川省成都市双流区怡心街道(街道/镇)美城云庭2栋2单元704'),
        (27, '冉意康', '13547180017', 'ranyikang@yitong.com.cn', 4, '5', 1, '四川省成都市双流区怡心(街道/镇)中海右岸一期33栋1302'),
        (28, '严坤', '18116758782', '1', 3, '1', 1, '四川省成都市双流区华阳南湖西路(街道/镇)南湖锦苑2栋'),
        (29, '宣凯', '17628042501', '1', 6, '1', 1, '四川省成都市武侯区火车南站街道(街道/镇)科华中路193号院'),
        (30, '唐元东', '18428035326', '1', 6, '1', 1, '四川省成都市天府新区华阳街道(街道/镇)蓝岸丽景'),
        (31, '满仲达', '13366461146', '1', 6, '1', 1, '四川省成都市高新区中和街道(街道/镇)红树湾二期');